{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"2632457c-d4d0-5f35-95c5-88dbb94f0fa9","excerpt":"Function composition is a great tool, to allow to create a more isolated function with clear responsibility and single purpose. Function composition allows combining these functions to create a more complex one. This pattern can also be used to…","frontmatter":{"date":"2018-10-30","path":"/compose-express-middlewares","title":"Compose express middlewares"}}},{"node":{"id":"b786bf68-e2b4-5d51-8032-d2de5bb35098","excerpt":"Save package exact version Because a lot of node package are not using semver, it is a good practice to save package exact version. or set the option globally Do not use npm start for production If you application intercept unix signals (SIGINT…","frontmatter":{"date":"2016-03-20","path":"/npm-tips-2016","title":"NPM tips"}}},{"node":{"id":"cba4b305-62ee-5368-a92a-47b9fad3cb70","excerpt":"Docker had a great cache mechanism, and you can easily use it to improve your image build time. Node Application Dockerfile You can use the below Dockerfile to run a simple nodejs application, but for every image build the command  npm install  will…","frontmatter":{"date":"2015-09-13","path":"/cache-npm-install-on-docker","title":"Cache npm install on docker"}}},{"node":{"id":"5846fdc8-3980-584a-a3f9-f64c5c98f370","excerpt":"Last week I was lucky enough to attend the ReactEurope Event in Paris, and it was a really interesting experience. Speakers and talks were amazing, and the organization of the event was perfect. Here are some notes I take during the event(Raw…","frontmatter":{"date":"2015-07-06","path":"/reacteurope-2015-my-notes","title":"ReactEurope 2015: Notes"}}},{"node":{"id":"23064b4d-66e1-5eb6-87ed-fe3cd1396bdb","excerpt":"\nBoot2docker is a really great tool to run docker on a mac computer, but the default option to share folders is  vboxfs , which can be an issue. Vboxfs  is really slow and you may encounter access and performance issues. A good solution is to use…","frontmatter":{"date":"2015-04-27","path":"/boot2docker-nfs-on-mac","title":"Boot2docker with NFS on OSX"}}},{"node":{"id":"8f61ec32-a490-573d-9b94-0376dd5aeaf9","excerpt":"After more than a year of developing  node-geocoder  library, I finally take the time to write a small article to present you this library. Node geocoder is a node.js module which provides an abstraction layer for geocoding and reverse geocoding…","frontmatter":{"date":"2015-01-26","path":"/geocoding-with-node-geocoder","title":"Geocoding in node.js with node-geocoder"}}},{"node":{"id":"8f378329-452b-5c06-8015-95f30857e367","excerpt":"As a contributor of some packages on npm, I will try my best to give you some tips on how to publish package on npm. NPM ? Node package manager is the official package manager for nodejs.\n npm doc Semver You must use  Semver  versioning for your…","frontmatter":{"date":"2014-08-31","path":"/publish-package-on-npm-best-practice","title":"Publish node package on NPM best practices"}}},{"node":{"id":"0567c4a2-a201-5072-a323-a14e3b878877","excerpt":"The aim of this article is to show you, how I mock my API when I test my angularjs applications. Why mock your API call? Testing client can be done in separation of the server Because third-party API which is non usable in test I won't test things…","frontmatter":{"date":"2014-06-01","path":"/test-angularjs-app-mock-backend","title":"Angular e2e tests, Mock your backend"}}},{"node":{"id":"c2e4c465-8aa8-5d32-8b06-0893ee487fbe","excerpt":"Hello World","frontmatter":{"date":"2014-05-20","path":"/hello-world","title":"Hello World"}}}]}},"pageContext":{}}